SolderedElectronics/Inkplate-Board-Definitions-for-Arduino-IDE/Inkplate_core-3.0.0/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.einksize=E-Ink Display Size

##############################################################

Inkplate13SPECTRA.name=Soldered Inkplate 13SPECTRA

Inkplate13SPECTRA.bootloader.tool=esptool_py
Inkplate13SPECTRA.bootloader.tool.default=esptool_py

Inkplate13SPECTRA.upload.tool=esptool_py
Inkplate13SPECTRA.upload.tool.default=esptool_py
Inkplate13SPECTRA.upload.tool.network=esp_ota

Inkplate13SPECTRA.upload.maximum_size=3145728
Inkplate13SPECTRA.upload.maximum_data_size=327680
Inkplate13SPECTRA.upload.speed=921600
Inkplate13SPECTRA.upload.flags=
Inkplate13SPECTRA.upload.extra_flags=
Inkplate13SPECTRA.upload.use_1200bps_touch=false
Inkplate13SPECTRA.upload.wait_for_upload_port=false

Inkplate13SPECTRA.serial.disableDTR=false
Inkplate13SPECTRA.serial.disableRTS=false

Inkplate13SPECTRA.build.tarch=xtensa
Inkplate13SPECTRA.build.bootloader_addr=0x0
Inkplate13SPECTRA.build.target=esp32s3
Inkplate13SPECTRA.build.mcu=esp32s3
Inkplate13SPECTRA.build.core=esp32
Inkplate13SPECTRA.build.variant=Inkplate_S3
Inkplate13SPECTRA.build.board=INKPLATE13SPECTRA

Inkplate13SPECTRA.build.usb_mode=1
Inkplate13SPECTRA.build.cdc_on_boot=0
Inkplate13SPECTRA.build.msc_on_boot=0
Inkplate13SPECTRA.build.dfu_on_boot=0
Inkplate13SPECTRA.build.f_cpu=240000000L
Inkplate13SPECTRA.build.flash_size=32MB
Inkplate13SPECTRA.build.flash_freq=80m
Inkplate13SPECTRA.build.flash_mode=dout

Inkplate13SPECTRA.build.boot=opi
Inkplate13SPECTRA.build.boot_freq=80m
Inkplate13SPECTRA.build.partitions=huge_app
Inkplate13SPECTRA.build.custom_partitions=huge_app
Inkplate13SPECTRA.build.defines=-DBOARD_HAS_PSRAM
Inkplate13SPECTRA.build.loop_core=
Inkplate13SPECTRA.build.event_core=
Inkplate13SPECTRA.build.psram_type=opi
Inkplate13SPECTRA.build.memory_type={build.boot}_{build.psram_type}

Inkplate13SPECTRA.menu.JTAGAdapter.default=Disabled
Inkplate13SPECTRA.menu.JTAGAdapter.default.build.copy_jtag_files=0
Inkplate13SPECTRA.menu.JTAGAdapter.builtin=Integrated USB JTAG
Inkplate13SPECTRA.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
Inkplate13SPECTRA.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
Inkplate13SPECTRA.menu.JTAGAdapter.external=FTDI Adapter
Inkplate13SPECTRA.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
Inkplate13SPECTRA.menu.JTAGAdapter.external.build.copy_jtag_files=1
Inkplate13SPECTRA.menu.JTAGAdapter.bridge=ESP USB Bridge
Inkplate13SPECTRA.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
Inkplate13SPECTRA.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

Inkplate13SPECTRA.menu.PSRAM.opi=OPI PSRAM
Inkplate13SPECTRA.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
Inkplate13SPECTRA.menu.PSRAM.opi.build.psram_type=opi
Inkplate13SPECTRA.menu.PSRAM.enabled=QSPI PSRAM
Inkplate13SPECTRA.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
Inkplate13SPECTRA.menu.PSRAM.enabled.build.psram_type=qspi
Inkplate13SPECTRA.menu.PSRAM.disabled=Disabled
Inkplate13SPECTRA.menu.PSRAM.disabled.build.defines=
Inkplate13SPECTRA.menu.PSRAM.disabled.build.psram_type=qspi

Inkplate13SPECTRA.menu.FlashMode.opi=OPI 80MHz
Inkplate13SPECTRA.menu.FlashMode.opi.build.flash_mode=dout
Inkplate13SPECTRA.menu.FlashMode.opi.build.boot=opi
Inkplate13SPECTRA.menu.FlashMode.opi.build.boot_freq=80m
Inkplate13SPECTRA.menu.FlashMode.opi.build.flash_freq=80m
Inkplate13SPECTRA.menu.FlashMode.qio=QIO 80MHz
Inkplate13SPECTRA.menu.FlashMode.qio.build.flash_mode=dio
Inkplate13SPECTRA.menu.FlashMode.qio.build.boot=qio
Inkplate13SPECTRA.menu.FlashMode.qio.build.boot_freq=80m
Inkplate13SPECTRA.menu.FlashMode.qio.build.flash_freq=80m
Inkplate13SPECTRA.menu.FlashMode.qio120=QIO 120MHz
Inkplate13SPECTRA.menu.FlashMode.qio120.build.flash_mode=dio
Inkplate13SPECTRA.menu.FlashMode.qio120.build.boot=qio
Inkplate13SPECTRA.menu.FlashMode.qio120.build.boot_freq=120m
Inkplate13SPECTRA.menu.FlashMode.qio120.build.flash_freq=80m
Inkplate13SPECTRA.menu.FlashMode.dio=DIO 80MHz
Inkplate13SPECTRA.menu.FlashMode.dio.build.flash_mode=dio
Inkplate13SPECTRA.menu.FlashMode.dio.build.boot=dio
Inkplate13SPECTRA.menu.FlashMode.dio.build.boot_freq=80m
Inkplate13SPECTRA.menu.FlashMode.dio.build.flash_freq=80m

Inkplate13SPECTRA.menu.FlashSize.32M=32MB (256Mb)
Inkplate13SPECTRA.menu.FlashSize.32M.build.flash_size=32MB
Inkplate13SPECTRA.menu.FlashSize.16M=16MB (128Mb)
Inkplate13SPECTRA.menu.FlashSize.16M.build.flash_size=16MB
Inkplate13SPECTRA.menu.FlashSize.4M=4MB (32Mb)
Inkplate13SPECTRA.menu.FlashSize.4M.build.flash_size=4MB
Inkplate13SPECTRA.menu.FlashSize.8M=8MB (64Mb)
Inkplate13SPECTRA.menu.FlashSize.8M.build.flash_size=8MB

Inkplate13SPECTRA.menu.LoopCore.1=Core 1
Inkplate13SPECTRA.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
Inkplate13SPECTRA.menu.LoopCore.0=Core 0
Inkplate13SPECTRA.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

Inkplate13SPECTRA.menu.EventsCore.1=Core 1
Inkplate13SPECTRA.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Inkplate13SPECTRA.menu.EventsCore.0=Core 0
Inkplate13SPECTRA.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

Inkplate13SPECTRA.menu.USBMode.hwcdc=Hardware CDC and JTAG
Inkplate13SPECTRA.menu.USBMode.hwcdc.build.usb_mode=1
Inkplate13SPECTRA.menu.USBMode.default=USB-OTG (TinyUSB)
Inkplate13SPECTRA.menu.USBMode.default.build.usb_mode=0

