SolderedElectronics/Inkplate-Board-Definitions-for-Arduino-IDE/Inkplate_core-3.0.0/boards.txt
Inkplate13SPECTRA.menu.CDCOnBoot.default=Disabled
Inkplate13SPECTRA.menu.CDCOnBoot.default.build.cdc_on_boot=0
Inkplate13SPECTRA.menu.CDCOnBoot.cdc=Enabled
Inkplate13SPECTRA.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

Inkplate13SPECTRA.menu.MSCOnBoot.default=Disabled
Inkplate13SPECTRA.menu.MSCOnBoot.default.build.msc_on_boot=0
Inkplate13SPECTRA.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
Inkplate13SPECTRA.menu.MSCOnBoot.msc.build.msc_on_boot=1

Inkplate13SPECTRA.menu.DFUOnBoot.default=Disabled
Inkplate13SPECTRA.menu.DFUOnBoot.default.build.dfu_on_boot=0
Inkplate13SPECTRA.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
Inkplate13SPECTRA.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Inkplate13SPECTRA.menu.UploadMode.default=UART0 / Hardware CDC
Inkplate13SPECTRA.menu.UploadMode.default.upload.use_1200bps_touch=false
Inkplate13SPECTRA.menu.UploadMode.default.upload.wait_for_upload_port=false
Inkplate13SPECTRA.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
Inkplate13SPECTRA.menu.UploadMode.cdc.upload.use_1200bps_touch=true
Inkplate13SPECTRA.menu.UploadMode.cdc.upload.wait_for_upload_port=true

Inkplate13SPECTRA.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.huge_app.build.custom_partitions=huge_app
Inkplate13SPECTRA.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate13SPECTRA.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
Inkplate13SPECTRA.menu.PartitionScheme.app3M_fat9M_16MB.build.custom_partitions=app3M_fat9M_16MB
Inkplate13SPECTRA.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
Inkplate13SPECTRA.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.default.build.custom_partitions=default
Inkplate13SPECTRA.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate13SPECTRA.menu.PartitionScheme.defaultffat.build.custom_partitions=default_ffat
Inkplate13SPECTRA.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.default_8MB.build.custom_partitions=default_8MB
Inkplate13SPECTRA.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
Inkplate13SPECTRA.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.minimal.build.custom_partitions=minimal
Inkplate13SPECTRA.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.no_ota.build.custom_partitions=no_ota
Inkplate13SPECTRA.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate13SPECTRA.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.noota_3g.build.custom_partitions=noota_3g
Inkplate13SPECTRA.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate13SPECTRA.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate13SPECTRA.menu.PartitionScheme.noota_ffat.build.custom_partitions=noota_ffat
Inkplate13SPECTRA.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate13SPECTRA.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate13SPECTRA.menu.PartitionScheme.noota_3gffat.build.custom_partitions=noota_3gffat
Inkplate13SPECTRA.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate13SPECTRA.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.min_spiffs.build.custom_partitions=min_spiffs
Inkplate13SPECTRA.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate13SPECTRA.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate13SPECTRA.menu.PartitionScheme.fatflash.build.custom_partitions=ffat
Inkplate13SPECTRA.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker=RainMaker 4MB
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker.build.custom_partitions=rainmaker
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker_4MB.build.custom_partitions=rainmaker_4MB_no_ota
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker_8MB.build.custom_partitions=rainmaker_8MB
Inkplate13SPECTRA.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
Inkplate13SPECTRA.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
Inkplate13SPECTRA.menu.PartitionScheme.app5M_fat24M_32MB.build.custom_partitions=large_fat_32MB
Inkplate13SPECTRA.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
Inkplate13SPECTRA.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
Inkplate13SPECTRA.menu.PartitionScheme.app5M_little24M_32MB.build.custom_partitions=large_littlefs_32MB
Inkplate13SPECTRA.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
Inkplate13SPECTRA.menu.PartitionScheme.app13M_data7M_32MB=32M Flash (13MB APP/6.75MB SPIFFS)
Inkplate13SPECTRA.menu.PartitionScheme.app13M_data7M_32MB.build.custom_partitions=default_32MB
Inkplate13SPECTRA.menu.PartitionScheme.app13M_data7M_32MB.upload.maximum_size=13107200

Inkplate13SPECTRA.menu.CPUFreq.240=240MHz (WiFi)
Inkplate13SPECTRA.menu.CPUFreq.240.build.f_cpu=240000000L
Inkplate13SPECTRA.menu.CPUFreq.160=160MHz (WiFi)
Inkplate13SPECTRA.menu.CPUFreq.160.build.f_cpu=160000000L
Inkplate13SPECTRA.menu.CPUFreq.80=80MHz (WiFi)
Inkplate13SPECTRA.menu.CPUFreq.80.build.f_cpu=80000000L
Inkplate13SPECTRA.menu.CPUFreq.40=40MHz
Inkplate13SPECTRA.menu.CPUFreq.40.build.f_cpu=40000000L
Inkplate13SPECTRA.menu.CPUFreq.20=20MHz
Inkplate13SPECTRA.menu.CPUFreq.20.build.f_cpu=20000000L
Inkplate13SPECTRA.menu.CPUFreq.10=10MHz
Inkplate13SPECTRA.menu.CPUFreq.10.build.f_cpu=10000000L

Inkplate13SPECTRA.menu.UploadSpeed.921600=921600
Inkplate13SPECTRA.menu.UploadSpeed.921600.upload.speed=921600

