SolderedElectronics/Inkplate-Board-Definitions-for-Arduino-IDE/Inkplate_core-3.0.0/boards.txt
##############################################################

Inkplate5.name=Soldered Inkplate 5

Inkplate5.bootloader.tool=esptool_py
Inkplate5.bootloader.tool.default=esptool_py

Inkplate5.upload.tool=esptool_py
Inkplate5.upload.tool.default=esptool_py
Inkplate5.upload.tool.network=esp_ota

Inkplate5.upload.maximum_size=3145728
Inkplate5.upload.maximum_data_size=327680
Inkplate5.upload.flags=
Inkplate5.upload.extra_flags=

Inkplate5.serial.disableDTR=true
Inkplate5.serial.disableRTS=true

Inkplate5.build.tarch=xtensa
Inkplate5.build.bootloader_addr=0x1000
Inkplate5.build.target=esp32
Inkplate5.build.mcu=esp32
Inkplate5.build.core=esp32
Inkplate5.build.variant=Inkplate
Inkplate5.build.board=INKPLATE5

Inkplate5.build.f_cpu=240000000L
Inkplate5.build.flash_size=4MB
Inkplate5.build.flash_freq=80m
Inkplate5.build.flash_mode=qio
Inkplate5.build.boot=dio
Inkplate5.build.partitions=default
Inkplate5.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate5.build.extra_libs=
Inkplate5.build.memory_type=qio_qspi

Inkplate5.menu.FlashSize.4M=4MB (32Mb)
Inkplate5.menu.FlashSize.4M.build.flash_size=4MB
Inkplate5.menu.FlashSize.2M=2MB (16Mb)
Inkplate5.menu.FlashSize.2M.build.flash_size=2MB

Inkplate5.menu.PSRAM.enabled=Enabled
Inkplate5.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate5.menu.PSRAM.disabled=Disabled
Inkplate5.menu.PSRAM.disabled.build.defines=

Inkplate5.menu.CPUFreq.240=240MHz (WiFi)
Inkplate5.menu.CPUFreq.240.build.f_cpu=240000000L
Inkplate5.menu.CPUFreq.160=160MHz (WiFi)
Inkplate5.menu.CPUFreq.160.build.f_cpu=160000000L
Inkplate5.menu.CPUFreq.80=80MHz (WiFi)
Inkplate5.menu.CPUFreq.80.build.f_cpu=80000000L
Inkplate5.menu.CPUFreq.40=40MHz
Inkplate5.menu.CPUFreq.40.build.f_cpu=40000000L
Inkplate5.menu.CPUFreq.20=20MHz
Inkplate5.menu.CPUFreq.20.build.f_cpu=20000000L
Inkplate5.menu.CPUFreq.10=10MHz
Inkplate5.menu.CPUFreq.10.build.f_cpu=10000000L

Inkplate5.menu.LoopCore.1=Core 1
Inkplate5.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
Inkplate5.menu.LoopCore.0=Core 0
Inkplate5.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

Inkplate5.menu.EventsCore.1=Core 1
Inkplate5.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Inkplate5.menu.EventsCore.0=Core 0
Inkplate5.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

Inkplate5.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate5.menu.PartitionScheme.huge_app.build.custom_partitions=huge_app
Inkplate5.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate5.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate5.menu.PartitionScheme.default.build.custom_partitions=default
Inkplate5.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate5.menu.PartitionScheme.defaultffat.build.custom_partitions=default_ffat
Inkplate5.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate5.menu.PartitionScheme.default_8MB.build.custom_partitions=default_8MB
Inkplate5.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate5.menu.PartitionScheme.minimal.build.custom_partitions=minimal
Inkplate5.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate5.menu.PartitionScheme.no_ota.build.custom_partitions=no_ota
Inkplate5.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate5.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate5.menu.PartitionScheme.noota_3g.build.custom_partitions=noota_3g
Inkplate5.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate5.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate5.menu.PartitionScheme.noota_ffat.build.custom_partitions=noota_ffat
Inkplate5.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate5.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate5.menu.PartitionScheme.noota_3gffat.build.custom_partitions=noota_3gffat
Inkplate5.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate5.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate5.menu.PartitionScheme.min_spiffs.build.custom_partitions=min_spiffs
Inkplate5.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate5.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate5.menu.PartitionScheme.fatflash.build.custom_partitions=ffat

Inkplate5.menu.FlashMode.qio=QIO
Inkplate5.menu.FlashMode.qio.build.flash_mode=dio
Inkplate5.menu.FlashMode.qio.build.boot=qio
Inkplate5.menu.FlashMode.dio=DIO
Inkplate5.menu.FlashMode.dio.build.flash_mode=dio
Inkplate5.menu.FlashMode.dio.build.boot=dio
Inkplate5.menu.FlashMode.qout=QOUT
Inkplate5.menu.FlashMode.qout.build.flash_mode=dout
Inkplate5.menu.FlashMode.qout.build.boot=qout
Inkplate5.menu.FlashMode.dout=DOUT
Inkplate5.menu.FlashMode.dout.build.flash_mode=dout
Inkplate5.menu.FlashMode.dout.build.boot=dout

Inkplate5.menu.FlashFreq.80=80MHz
Inkplate5.menu.FlashFreq.80.build.flash_freq=80m
Inkplate5.menu.FlashFreq.40=40MHz
Inkplate5.menu.FlashFreq.40.build.flash_freq=40m

Inkplate5.menu.UploadSpeed.921600=921600
Inkplate5.menu.UploadSpeed.921600.upload.speed=921600
Inkplate5.menu.UploadSpeed.460800=460800
Inkplate5.menu.UploadSpeed.460800.upload.speed=460800
Inkplate5.menu.UploadSpeed.115200=115200
Inkplate5.menu.UploadSpeed.115200.upload.speed=115200
Inkplate5.menu.UploadSpeed.256000.windows=256000
Inkplate5.menu.UploadSpeed.256000.upload.speed=256000
Inkplate5.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate5.menu.UploadSpeed.230400=230400
Inkplate5.menu.UploadSpeed.230400.upload.speed=230400
Inkplate5.menu.UploadSpeed.512000.windows=512000
Inkplate5.menu.UploadSpeed.512000.upload.speed=512000

Inkplate5.menu.DebugLevel.none=None
Inkplate5.menu.DebugLevel.none.build.code_debug=0
Inkplate5.menu.DebugLevel.error=Error
Inkplate5.menu.DebugLevel.error.build.code_debug=1
Inkplate5.menu.DebugLevel.warn=Warn
Inkplate5.menu.DebugLevel.warn.build.code_debug=2
Inkplate5.menu.DebugLevel.info=Info
Inkplate5.menu.DebugLevel.info.build.code_debug=3
Inkplate5.menu.DebugLevel.debug=Debug
Inkplate5.menu.DebugLevel.debug.build.code_debug=4
Inkplate5.menu.DebugLevel.verbose=Verbose
Inkplate5.menu.DebugLevel.verbose.build.code_debug=5

Inkplate5.menu.EraseFlash.none=Disabled
Inkplate5.menu.EraseFlash.none.upload.erase_cmd=
Inkplate5.menu.EraseFlash.all=Enabled
Inkplate5.menu.EraseFlash.all.upload.erase_cmd=-e

