SolderedElectronics/Inkplate-Board-Definitions-for-Arduino-IDE/Inkplate_core-3.0.0/boards.txt
##############################################################

Inkplate6COLOR.name=Soldered Inkplate 6COLOR

Inkplate6COLOR.bootloader.tool=esptool_py
Inkplate6COLOR.bootloader.tool.default=esptool_py

Inkplate6COLOR.upload.tool=esptool_py
Inkplate6COLOR.upload.tool.default=esptool_py
Inkplate6COLOR.upload.tool.network=esp_ota

Inkplate6COLOR.upload.maximum_size=3145728
Inkplate6COLOR.upload.maximum_data_size=327680
Inkplate6COLOR.upload.flags=
Inkplate6COLOR.upload.extra_flags=

Inkplate6COLOR.serial.disableDTR=true
Inkplate6COLOR.serial.disableRTS=true

Inkplate6COLOR.build.tarch=xtensa
Inkplate6COLOR.build.bootloader_addr=0x1000
Inkplate6COLOR.build.target=esp32
Inkplate6COLOR.build.mcu=esp32
Inkplate6COLOR.build.core=esp32
Inkplate6COLOR.build.variant=Inkplate
Inkplate6COLOR.build.board=INKPLATECOLOR

Inkplate6COLOR.build.f_cpu=240000000L
Inkplate6COLOR.build.flash_size=4MB
Inkplate6COLOR.build.flash_freq=80m
Inkplate6COLOR.build.flash_mode=qio
Inkplate6COLOR.build.boot=dio
Inkplate6COLOR.build.partitions=default
Inkplate6COLOR.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate6COLOR.build.extra_libs=
Inkplate6COLOR.build.memory_type=qio_qspi

Inkplate6COLOR.menu.FlashSize.4M=4MB (32Mb)
Inkplate6COLOR.menu.FlashSize.4M.build.flash_size=4MB
Inkplate6COLOR.menu.FlashSize.2M=2MB (16Mb)
Inkplate6COLOR.menu.FlashSize.2M.build.flash_size=2MB

Inkplate6COLOR.menu.PSRAM.enabled=Enabled
Inkplate6COLOR.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate6COLOR.menu.PSRAM.disabled=Disabled
Inkplate6COLOR.menu.PSRAM.disabled.build.defines=

Inkplate6COLOR.menu.CPUFreq.240=240MHz (WiFi)
Inkplate6COLOR.menu.CPUFreq.240.build.f_cpu=240000000L
Inkplate6COLOR.menu.CPUFreq.160=160MHz (WiFi)
Inkplate6COLOR.menu.CPUFreq.160.build.f_cpu=160000000L
Inkplate6COLOR.menu.CPUFreq.80=80MHz (WiFi)
Inkplate6COLOR.menu.CPUFreq.80.build.f_cpu=80000000L
Inkplate6COLOR.menu.CPUFreq.40=40MHz
Inkplate6COLOR.menu.CPUFreq.40.build.f_cpu=40000000L
Inkplate6COLOR.menu.CPUFreq.20=20MHz
Inkplate6COLOR.menu.CPUFreq.20.build.f_cpu=20000000L
Inkplate6COLOR.menu.CPUFreq.10=10MHz
Inkplate6COLOR.menu.CPUFreq.10.build.f_cpu=10000000L

Inkplate6COLOR.menu.LoopCore.1=Core 1
Inkplate6COLOR.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
Inkplate6COLOR.menu.LoopCore.0=Core 0
Inkplate6COLOR.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

Inkplate6COLOR.menu.EventsCore.1=Core 1
Inkplate6COLOR.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Inkplate6COLOR.menu.EventsCore.0=Core 0
Inkplate6COLOR.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

Inkplate6COLOR.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.huge_app.build.custom_partitions=huge_app
Inkplate6COLOR.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate6COLOR.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.default.build.custom_partitions=default
Inkplate6COLOR.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate6COLOR.menu.PartitionScheme.defaultffat.build.custom_partitions=default_ffat
Inkplate6COLOR.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.default_8MB.build.custom_partitions=default_8MB
Inkplate6COLOR.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.minimal.build.custom_partitions=minimal
Inkplate6COLOR.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.no_ota.build.custom_partitions=no_ota
Inkplate6COLOR.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate6COLOR.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.noota_3g.build.custom_partitions=noota_3g
Inkplate6COLOR.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate6COLOR.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate6COLOR.menu.PartitionScheme.noota_ffat.build.custom_partitions=noota_ffat
Inkplate6COLOR.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate6COLOR.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate6COLOR.menu.PartitionScheme.noota_3gffat.build.custom_partitions=noota_3gffat
Inkplate6COLOR.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate6COLOR.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate6COLOR.menu.PartitionScheme.min_spiffs.build.custom_partitions=min_spiffs
Inkplate6COLOR.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate6COLOR.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate6COLOR.menu.PartitionScheme.fatflash.build.custom_partitions=ffat

Inkplate6COLOR.menu.FlashMode.qio=QIO
Inkplate6COLOR.menu.FlashMode.qio.build.flash_mode=dio
Inkplate6COLOR.menu.FlashMode.qio.build.boot=qio
Inkplate6COLOR.menu.FlashMode.dio=DIO
Inkplate6COLOR.menu.FlashMode.dio.build.flash_mode=dio
Inkplate6COLOR.menu.FlashMode.dio.build.boot=dio
Inkplate6COLOR.menu.FlashMode.qout=QOUT
Inkplate6COLOR.menu.FlashMode.qout.build.flash_mode=dout
Inkplate6COLOR.menu.FlashMode.qout.build.boot=qout
Inkplate6COLOR.menu.FlashMode.dout=DOUT
Inkplate6COLOR.menu.FlashMode.dout.build.flash_mode=dout
Inkplate6COLOR.menu.FlashMode.dout.build.boot=dout

Inkplate6COLOR.menu.FlashFreq.80=80MHz
Inkplate6COLOR.menu.FlashFreq.80.build.flash_freq=80m
Inkplate6COLOR.menu.FlashFreq.40=40MHz
Inkplate6COLOR.menu.FlashFreq.40.build.flash_freq=40m

Inkplate6COLOR.menu.UploadSpeed.921600=921600
Inkplate6COLOR.menu.UploadSpeed.921600.upload.speed=921600
Inkplate6COLOR.menu.UploadSpeed.460800=460800
Inkplate6COLOR.menu.UploadSpeed.460800.upload.speed=460800
Inkplate6COLOR.menu.UploadSpeed.115200=115200
Inkplate6COLOR.menu.UploadSpeed.115200.upload.speed=115200
Inkplate6COLOR.menu.UploadSpeed.256000.windows=256000
Inkplate6COLOR.menu.UploadSpeed.256000.upload.speed=256000
Inkplate6COLOR.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate6COLOR.menu.UploadSpeed.230400=230400
Inkplate6COLOR.menu.UploadSpeed.230400.upload.speed=230400
Inkplate6COLOR.menu.UploadSpeed.512000.windows=512000
Inkplate6COLOR.menu.UploadSpeed.512000.upload.speed=512000

